import random

writers = [["Пушкин А.С","16.05.1799"],["Тютчев Ф.И.","13.11.1803"],["Гоголь Н.В","20.03.1807"],["Лермонтов М.Ю.","03.10.1814"],["Некрасов.А.Н.","10.12.1821"]]

month = ["Января","Февраля","Марта","Апреля","Мая","Июня","Июля","Августа","Сентября","Октября","Ноября","Декабря"]

days = ["Первого","Второго","Третьего","Четвертого","Пятого","Шестого","Седьмого","Восьмого","Девятого","Десятого","Одинадцатого","Двенадцатого","Тринадцатого","Четырнадцатого","Пятнадцатого","Шестнадцатого","Семнадцатого",
        "Восемнадцатого","Девятнадцатого","Двадцатого"]

question = random.sample(writers,3)

for i in range(3):
    date=input("Введите ату рождения писателя {} в формате dd.mm.yyyy". format(question[i][0]))
    if date == question[i][1]:
        print("Верно")
    else:
        print("Неверно")

        print("Его дата рождения {0} {1} {2} года".format(days[int(question[i][1][:2])-1],month[int(question[i][1][3:5])-1],question[i][1][6:]), end="\n\n")

#Все остальное как и в прошлый раз. 

